class CreateSpecdataService

	GENERAL_INFO = <<-DOCS
	  <p><b>Морське пластування</b> є однією з ділянок пластової програми для <a href="/wiki/%D0%9F%D0%BB%D0%B0%D1%81%D1%82_(%D0%BE%D1%80%D0%B3%D0%B0%D0%BD%D1%96%D0%B7%D0%B0%D1%86%D1%96%D1%8F)" title="Пласт (організація)">пластунів</a>, які хочуть брати участь в заняттях, що пов'язані з водою і набути знання в цій ділянці. Мета морського пластування - зацікавити пластунів мореплавством. Для юнаків це нагода надати цікавий зміст пластуванню і дуже багато нових вражень.</p>
<p>Морським пластуванням в <a href="/wiki/%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D0%B0" title="Україна">Україні</a> займаються курені <span style="color: blue"><b><a href="/wiki/%D0%A7%D0%BE%D1%80%D0%BD%D0%BE%D0%BC%D0%BE%D1%80%D1%86%D1%96_(%D0%BF%D0%BB%D0%B0%D1%81%D1%82%D0%BE%D0%B2%D0%B8%D0%B9_%D0%BA%D1%83%D1%80%D1%96%D0%BD%D1%8C)" title="Чорноморці (пластовий курінь)">"Чорноморці"</a></b></span> і <span style="color: blue"><b>"Чорноморські хвилі"</b></span>. Ідея діяльності цих куренів - плекання традицій українського моря і поширення морського пластування, проведення водних і морських мандрівок, вишколів та таборів, виховництво та інструкторство.Патроном морського пластування є Святий Миколай - покровитель моряків і мандрівників.</p>
<p>Дещо з історії морського пластування.</p>
<p>В 1926р. у Львові існував підготовчий ст.пл. курінь ім. Сотника Федора Черника. В курені були три гуртки: ім. Бою під Крутами, ім. Лицарів Залізної Остроги і водний гурток. Старше пластунство почало розширюватися і в результаті цього члени гуртка ім. Бою під Крутами почали діяти як курінь "Лісові Чорти", гурток ім. Лицарів Залізної Остроги залишився самостійним гуртком, а водний пластовий гурток почав існувати, як самостійний курінь водного пластування під назвою "Чорноморці".</p>
<p>У 1927р. відбулась мандрівка човнами по Дністрі. А наступного року відбувся перший морський табір в Монастирку над Дністром.</p>
<p>З 1930р. через заборону пласту польською владою курінь існував підпільно і був відновлений, як 25 курінь УСП "Чорноморці", в Німеччині в 1947р українцями в діаспорі.</p>
<p>У 1957р. у США з'явився дівочий гурток, метою якого було заняття морським пластуванням. Через деякий час (1960р.) цей гурток був затвердженний як курінь УСП ч.16 "Чорноморські Хвилі".</p>
<p>Коли Пласт почав відроджуватись, морське пластування почало розвиватись і поширюватись. В 1990р. "Чорноморці" сплавлялися річкою Черемош, після чого з часом з'явився ВППв "Черемош" - водний вишкіл практичного пластування. У 1992р. був проведений перший ВКПМП (вишкільний курс провідників морського пластування) "Чорноморцями" з Америки. Пізніше у 1993 відбувся перший водний табір "Мокрота" і перший Крайовий Морський Табір „Повернення моря”.</p>
<p>Наразі ЧХ і ЧМ організовують безліч акцій протягом року. Кожної зими відбувається Зимова Зустріч (Мала рада) ЧМ і ЧХ, на якій плануються акції і табори. Оскільки Св. Миколай є патроном морського пластування, ЧМ і ЧХ організовують свято Миколая. Щороку в треті вихідні лютого "Чорноморські Хвилі" проводять Чорноморський бал, метою якого є відновлення традицій балу. Весною, 29 квітня (цього ж числа був вперше піднятий український прапор на українському флоті), проходить Свято Моря в формі теренової гри для юнацтва. На початку травня відбувається ВППв "Черемош". Влітку проходить велика рада куренів (Літня зустріч), де також вирішуються питання щодо річної організації морських акцій. А також Крайовий Мандрівний Морський Табір "Друга Стихія" і Крайовий Морський Табір</p>
	DOCS
  
  def call text, spec_id
    data = Specdatum.find_or_create_by!(specialization_id: spec_id) do |data|
    	data.gen_info = GENERAL_INFO
      data.proby = text
      data.activity = text
      data.provid = text
      # data.pologennya = ".."
      end
  end

end
