class CreateSpecdataService

	GENERAL_INFO = <<-DOCS
	  
<p>
    <b>Морське пластування</b> є однією з ділянок пластової програми для 
    <a href="/wiki/%D0%9F%D0%BB%D0%B0%D1%81%D1%82_(%D0%BE%D1%80%D0%B3%D0%B0%D0%BD%D1%96%D0%B7%D0%B0%D1%86%D1%96%D1%8F)" title="Пласт (організація)">пластунів</a>, які хочуть брати участь в заняттях, що пов'язані з водою і набути знання в цій ділянці. Мета морського пластування - зацікавити пластунів мореплавством. Для юнаків це нагода надати цікавий зміст пластуванню і дуже багато нових вражень.
</p>
<p>Морським пластуванням в 
    <a href="/wiki/%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D0%B0" title="Україна">Україні</a> займаються курені 
    <span style="color: blue">
        <b>
            <a href="/wiki/%D0%A7%D0%BE%D1%80%D0%BD%D0%BE%D0%BC%D0%BE%D1%80%D1%86%D1%96_(%D0%BF%D0%BB%D0%B0%D1%81%D1%82%D0%BE%D0%B2%D0%B8%D0%B9_%D0%BA%D1%83%D1%80%D1%96%D0%BD%D1%8C)" title="Чорноморці (пластовий курінь)">"Чорноморці"</a>
        </b>
    </span> і 
    <span style="color: blue">
        <b>"Чорноморські хвилі"</b>
    </span>. Ідея діяльності цих куренів - плекання традицій українського моря і поширення морського пластування, проведення водних і морських мандрівок, вишколів та таборів, виховництво та інструкторство.Патроном морського пластування є Святий Миколай - покровитель моряків і мандрівників.
</p>
<p>Дещо з історії морського пластування.</p>
<p>В 1926р. у Львові існував підготовчий ст.пл. курінь ім. Сотника Федора Черника. В курені були три гуртки: ім. Бою під Крутами, ім. Лицарів Залізної Остроги і водний гурток. Старше пластунство почало розширюватися і в результаті цього члени гуртка ім. Бою під Крутами почали діяти як курінь "Лісові Чорти", гурток ім. Лицарів Залізної Остроги залишився самостійним гуртком, а водний пластовий гурток почав існувати, як самостійний курінь водного пластування під назвою "Чорноморці".</p>
<p>У 1927р. відбулась мандрівка човнами по Дністрі. А наступного року відбувся перший морський табір в Монастирку над Дністром.</p>
<p>З 1930р. через заборону пласту польською владою курінь існував підпільно і був відновлений, як 25 курінь УСП "Чорноморці", в Німеччині в 1947р українцями в діаспорі.</p>
<p>У 1957р. у США з'явився дівочий гурток, метою якого було заняття морським пластуванням. Через деякий час (1960р.) цей гурток був затвердженний як курінь УСП ч.16 "Чорноморські Хвилі".</p>
<p>Коли Пласт почав відроджуватись, морське пластування почало розвиватись і поширюватись. В 1990р. "Чорноморці" сплавлялися річкою Черемош, після чого з часом з'явився ВППв "Черемош" - водний вишкіл практичного пластування. У 1992р. був проведений перший ВКПМП (вишкільний курс провідників морського пластування) "Чорноморцями" з Америки. Пізніше у 1993 відбувся перший водний табір "Мокрота" і перший Крайовий Морський Табір „Повернення моря”.</p>
<p>Наразі ЧХ і ЧМ організовують безліч акцій протягом року. Кожної зими відбувається Зимова Зустріч (Мала рада) ЧМ і ЧХ, на якій плануються акції і табори. Оскільки Св. Миколай є патроном морського пластування, ЧМ і ЧХ організовують свято Миколая. Щороку в треті вихідні лютого "Чорноморські Хвилі" проводять Чорноморський бал, метою якого є відновлення традицій балу. Весною, 29 квітня (цього ж числа був вперше піднятий український прапор на українському флоті), проходить Свято Моря в формі теренової гри для юнацтва. На початку травня відбувається ВППв "Черемош". Влітку проходить велика рада куренів (Літня зустріч), де також вирішуються питання щодо річної організації морських акцій. А також Крайовий Мандрівний Морський Табір "Друга Стихія" і Крайовий Морський Табір</p>
	DOCS

	PROBA = <<-DOCS

    «Скобиний лет» — Третя проба УПЮ (16-18 років)— ступінь пластуна-скоба (пластунки-вірлиці).

Ця проба не містить жодних конкретних вимог, які слід виконати. Натомість пластун має зреалізувати 9 тематичних проектів, результатом котрих буде позитивний ефект для Пласту чи суспільства.

Третя проба — засіб реалізації мети Пласту з підготовки свідомих, відповідальних і повновартісних громадян, провідників суспільства.
	DOCS

	ACTIVITIES = <<-DOCS
	Головною діяльністю «Чорноморців» в Україні є організація і проведення крайових, окружних й станичних таборів, вишколів та акцій. Більшість членів куреня є професійними інструкторами з водних ділянок, практичного мореплавства та водного мандрівництва. Щовесни курінь проводить водний вишкіл практичного пластування «Черемош», де навчає пластунів техніки сплавів бурхливими гірськими річками (Чорний, Черемош, Свіча, Прут). Мандрівний морський табір зазвичай відбувається в липні та збирає кілька десятків учасників для двотижневої, близько 200 км мандрівки річкою Дністер. Підсумком річної діяльності є Крайовий морський табір, що користується неабиякою популярністю серед юнацтва. Сюди учасників манять вода (табір завжди відбувається на березі великих водойм або морському узбережжі), а також цікаві гутірки з вітрильництва, водолажання, каякарства, плавання, віндсерфінгу, навігації, лоції, будови корабля та інші. У тісній співпраці з куренем УСП «Чорноморські хвилі», «Чорноморці» також організовують «Свято моря», «Чорноморський бал», акції з вшанування пам’яті Романа Шухевича (що був одним із засновників куреня) морські точки на Святах весни, теренівки тощо. Члени куреня активно долучаються до проводу станиць та краю. Морські курені також славляться безліччю традицій та церемоніалів, що наповнюють морські табори особливою атмосферою.
	DOCS

	PROVID = <<-DOCS
<p>
    <strong>
        <span lang="UK">
            <img src="http://www.plastusa.org/attachments/article/217/mortsi.jpg" style="float: left; margin-top: 5px; margin-bottom: 5px; margin-left: 10px; margin-right: 10px;" height="200" width="125">Мета куреня:
            </span>
        </strong>
        <span lang="UK">
            <strong>&nbsp;&nbsp;</strong>плекання та поширювання культу Українського Моря
        серед українського суспільства та організування і ведення водного пластування
        </span>
    </p>
    <p>
        <span lang="UK">Курінь 
            <em>Чорноморці </em>розвинув морське пластування як окрему ділянку пластової програми та щороку провадить морський табір. Тут юнацтво та старше пластунство має змогу брати участь в канойкарстві, вітрильництві, в різних водних спортах та вправах. Курінь організує прогулянки, спортові змагання та Морський Баль в Ню Джерзі кожного листопада. Під проводом Чорноморців відбувся в 1964 році перший пластовий летунський табір. Всі члени куреня вивчають всі штуки та науки мореплавства та морезнавства в товариському дусі. 
        </span>
    </p>
    <p>
        <strong>
            <span lang="UK">Патрон:&nbsp; </span>
        </strong>
        <span lang="UK">св. Миколай</span>
    </p>
    <p>
        <span lang="UK">
            <strong>Мережа:&nbsp;</strong>
        </span>
        <span lang="UK">
            <a href="http://www.chornomortsi.org" target="_blank">www.chornomortsi.org</a>
        </span>
    </p>
    <p>
        <strong>
            <span lang="UK">Клич:</span>
        </strong>
        <span lang="UK">
            <strong>&nbsp;</strong> привітання - „Агой!” / прощання - „Доброго вітру!”
        </span>
    </p>
    <p>
        <strong>
            <span lang="UK">Гасло:</span>
        </strong>
        <span lang="UK"> &nbsp;„Navigare necesse est – vivere non!”</span>
    </p>
    <p>
        <strong>
            <span lang="UK">Хустка:</span>
        </strong>
        <span lang="UK">
            <strong>&nbsp;</strong> темно-синя обведена трьома білими стрічками
        </span>
    </p>
    <p class="MsoNormal" style="line-height: normal; margin: 0in 0in 10pt; mso-margin-top-alt: auto; mso-margin-bottom-alt: auto;">
        <strong>
            <span lang="UK">Рік засновання:</span>
        </strong>
        <span lang="UK"> 1927 р. в Львові </span>
    </p>
	DOCS
  
  def call text, spec_id
    data = Specdatum.find_or_create_by!(specialization_id: spec_id) do |data|
    	data.gen_info = GENERAL_INFO
      data.proby = PROBA
      data.activity = ACTIVITIES
      data.provid = PROVID
      # data.pologennya = ".."
      end
  end

end
